examples/coupled/resting/openfoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	 2.0;
	format	 ascii;
	class	 dictionary;
	object	 controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application 	 cplIcoFoam;
startform 	 startTime;
startTime 	 0;
stopAt 	 endTime;
endTime 	 0.2501;
deltaT 	 0.0001;
writeControl 	 runTime;
writeInterval 	 0.005;
purgeWrite 	 0;
writeFormat 	 ascii;
writePrecision 	 6;
writeCompression 	 off;
timeFormat 	 general;
timePrecision 	 6;
runTimeModifiable 	 true;
graphFormat 	 raw;

DebugSwitches
{
	dimensionSet 0;
}
// ************************************************************************* //
